tutorials/consistentSolvers/consistentIcoFoam/cavityBlock/system/fvSchemes
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object fvSchemes;
}

ddtSchemes
{
  default bdf2;
}

gradSchemes
{
  default Gauss linear;
}

divSchemes
{
  default no;
  div(phi,U) Gauss linearUpwind Gauss linear 1;
}

laplacianSchemes
{
  default Gauss linear corrected;
}

interpolationSchemes
{
  default linear;
}

snGradSchemes
{
  default corrected;
}

fluxRequired
{
  default no;
  pcorr /* empty */ ;
  p /* empty */ ;
} 	// ************************************************************************* //
